In [44]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# Pandas
1. Series --- 1D Array(Pandas Series is nothing but a column in an excel sheet)
2. Data Frame --- 2D Array (Table format includes Rows and Columns)

1. Series

In [2]:
#In order to create 1D array using pandas we have to use class Series inside pandas library
#In order to create 2D array using pandas we have to use class DataFrame inside pandas library
#Indexing Always Starts from 0
a=pd.Series([])
b=pd.Series([1,2,3,4],index=['a','2','c','4'])#Here indexing Means the first collumn Defining the SN.NO:(giving referene at every position)
c=pd.Series([1,2,3,4,5,6,7,9])
d=pd.Series({'a':10,'b':2})

In [3]:
print(type(a))

<class 'pandas.core.series.Series'>

In [4]:
type(b)

pandas.core.series.Series

In [5]:
b

a    1
2    2
c    3
4    4
dtype: int64

In [6]:
c

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    9
dtype: int64

In [7]:
d

a    10
b     2
dtype: int64

In [8]:
#Storing series in variable and again storing it into another
i=pd.Series([1,2,3,4])#First VAr
x=pd.Series(i)#Second Var
print(i)
print(type(i))

0    1
1    2
2    3
3    4
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
#We can also Pass a list within a list at a particular index
j=pd.Series([1,2,3,['Hello','Goodbye'],4])
print(j)

0                   1
1                   2
2                   3
3    [Hello, Goodbye]
4                   4
dtype: object

In [10]:
#We can also Access Specific items in the series
print(c)
print("The first item in the series is:\n",c[0])
print("The Fourth item in the series is:\n",c[3])
print("The Seventh item in the series is:\n",c[6])
#We can use Slicing also in the Series with the help of list
print("All the elements from third position\n",c[2:])

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    9
dtype: int64
The first item in the series is:
 1
The Fourth item in the series is:
 4
The Seventh item in the series is:
 7
All the elements from third position
 2    3
3    4
4    5
5    6
6    7
7    9
dtype: int64

In [11]:
#We can customize Index in this way Also
l=pd.Series([1,45,56,67,34,2322,3434,45],index=list('abcdefgh'))
print(l)

a       1
b      45
c      56
d      67
e      34
f    2322
g    3434
h      45
dtype: int64

In [12]:
#In order to find how many Similar Elements are present in the series
p=pd.Series([1,2,34,343,434,3,43,4,34,34,3,4,3,43,4,1,1,1,1,1,1,2,2,2,2,2,2,56,67,34,]) 
p.value_counts()# Prints ( Value  and Counts)

1      7
2      7
34     4
3      3
4      3
43     2
343    1
434    1
56     1
67     1
dtype: int64

In [13]:
#In order to find index of the Maximum element
p.argmax()
#In order to find index of the Minimum element
# p.argmin()

4

In [14]:
#In order to find the index of the maximum element(similar to argmax)
p.idxmax()
#In order to find the index of the Minimum element(similar to argmin)
p.idxmin()

0

In [15]:
#Accessing the specific elements through custom indexing
print(b['c'])
print(b['a'])

3
1

# Dataframe

In [99]:
x=pd.DataFrame([99,99,99,96,45,67,45,67,67,97,87,978,98,97])
y=pd.DataFrame([[1,2,3,4],[5,6,7,8]])
z=pd.DataFrame([[10,11,12,13,12],[14,15,16,17,12],[18,19,20,21,12],[22,2,24,25,12],[34,45,56,76,12],[34,34,54,6,12]])

In [18]:
z
print(type(z))

<class 'pandas.core.frame.DataFrame'>

In [21]:
x.head()

    0
0  99
1  98
2  97
3  96

In [25]:
y

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [36]:
z

    0   1   2   3   4
0  10  11  12  13  12
1  14  15  16  17  12
2  18  19  20  21  12
3  22   2  24  25  12
4  34  45  56  76  12
5  34  34  54   6  12

In [39]:
# z.head()#This will show the first 5 indices of the table
z.tail()#this will show the last 5 indices of the table

    0   1   2   3   4
1  14  15  16  17  12
2  18  19  20  21  12
3  22   2  24  25  12
4  34  45  56  76  12
5  34  34  54   6  12

In [24]:
print(type(x))
print(type(y))
print(type(z))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [40]:
print(z.head(1))#We can also pass arguments in order to print N numbers of indices

    0   1   2   3   4
0  10  11  12  13  12

In [41]:
print(y.head(2))

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [43]:
print(z.sample(2))#This will print any two samples in the dataframe

    0   1   2   3   4
4  34  45  56  76  12
0  10  11  12  13  12

In [49]:
#In order to pass Null number in the Dataframe we can use Numpy(np.nan)
j=pd.DataFrame([[1,3,np.nan,np.nan],["Empty",3,4,5],[np.nan,np.nan,89,98]])
j

       0    1     2     3
0      1  3.0   NaN   NaN
1  Empty  3.0   4.0   5.0
2    NaN  NaN  89.0  98.0

In [76]:
#We can also customize the collumns as we did in the series
j=pd.DataFrame([[1,3,np.nan,np.nan],[np.nan,56,4,5],[10,np.nan,89,98]],columns=['a','b','c','d'])
j

      a     b     c     d
0   1.0   3.0   NaN   NaN
1   NaN  56.0   4.0   5.0
2  10.0   NaN  89.0  98.0

In [77]:
j[['a','b']].head(2)

     a     b
0  1.0   3.0
1  NaN  56.0

In [78]:
#Here shape is not defined as function 
j.shape

(3, 4)

In [79]:
#In order to find the maximum Element in the particular row
j['b'].max()

56.0

In [80]:
j['c'].max()

89.0

In [81]:
j['a'].max()

10.0

In [82]:
#In order to find the minimum element in the paritcular row
j['a'].min()

1.0

In [87]:
#In order to create new column
j['new_col']=[2,3,4]
j

      a     b     c     d  new_col
0   1.0   3.0   NaN   NaN        2
1   NaN  56.0   4.0   5.0        3
2  10.0   NaN  89.0  98.0        4

In [90]:
#By adding two columns creating a new one
j['2nd new column']=j['new_col']+j['a']
j

      a     b     c     d  new_col  2nd new column
0   1.0   3.0   NaN   NaN        2             3.0
1   NaN  56.0   4.0   5.0        3             NaN
2  10.0   NaN  89.0  98.0        4            14.0

In [95]:
#In order to find which element is lesser or greater from a particular number in a column
j['new_col']>2
#In order to find how many are there which are greater
sum(j['new_col']>2)

2

In [96]:
j[a]

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [97]:
j['a']

0     1.0
1     NaN
2    10.0
Name: a, dtype: float64

In [116]:
#we can also find the how many times a number is printed in a column
l=pd.DataFrame([[1,3,np.nan,np.nan],[np.nan,56,4,5],[10,np.nan,89,98]],columns=['a','b','c','d'])
print(type(l))
l['a'].value_counts()#Necessary to give it a collumn

<class 'pandas.core.frame.DataFrame'>

1.0     1
10.0    1
Name: a, dtype: int64